Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: If not equal, the sequences are ordered the same as their first differing elements. For example, ``[1,2,x] <= [1,2,y]`` has the same value as ``x <= y``. If the corresponding element does not exist, the shorter sequence is ordered first (for example, ``[1,2] < [1,2,3]``).
ru: Если последовательности не равны, то они упорядочиваются по первым несовпадающим элементам. Например, «``[1,2,x] <= [1,2,y]``» имеет тот же результат, что и «``x <= y``» . Если соответствующий элемент отсутствует, то более короткая последовательность меньше (идёт раньше) , например : «``[1,2]``» < «``[1,2,3]``» .

source: Mappings (dictionaries) compare equal if and only if their sorted ``(key, value)`` lists compare equal. [#]_ Outcomes other than equality are resolved consistently, but are not otherwise defined. [#]_
ru: Отображения (словари) равны только если равны их отсортированные по ключу списки пар ключ-значение (в данной реализации такое сравнение производится эффективно – без реального конструирования списков или сортирования). [#]_ Другие результаты сравнения, кроме равенства – решаются соответственно, (?) но не определены иначе. [#]_ Предыдущие версии Питона использовали сравнение таких отсортированных списков (из пар ключ-значение) по первому несовпадающему элементу (тоесть, “лексикографически” ) , но это было слишком затратно для наиболее распространенного случая – проверки только на равенство. Ещё более ранние версии Питона сравнивали словари только по факту того один и тот же ли это объект, но это приводило к неожиданностям – поскольку люди ожидали иметь возможность проверять пуст ли словарь, сравнивая его с «``{}``» (новым пустым словарём) .

source: Sets and frozensets define comparison operators to mean subset and superset tests. Those relations do not define total orderings (the two sets ``{1,2}`` and {2,3} are not equal, nor subsets of one another, nor supersets of one another). Accordingly, sets are not appropriate arguments for functions which depend on total ordering. For example, :func:`min`, :func:`max`, and :func:`sorted` produce undefined results given a list of sets as inputs.
ru: Множества (“sets”) и фиксированные множества (“frozensets”) определяют операторы сравнения для реализации понятий подмножества и надмножества. Эти отношения не подразумевают определения полного упорядочивания (например, множества «``{1,2}``» и «``{2,3}``» ни равны, ни подмножество или надмножество одно для другого) . Соответственно – множества не являются годными аргументами для функций, результат которых зависит от полного упорядочивания. Например : «:func:`min`» , «:func:`max`» и «:func:`sorted`» выдают неопределённый результат, получив список множеств.

source: Most other objects of built-in types compare unequal unless they are the same object; the choice whether one object is considered smaller or larger than another one is made arbitrarily but consistently within one execution of a program.
ru: Большинство других объектов встроенных типов считаются неравными, за исключением случая, когда это оказывается один и тот же объект. Выбор того, считается ли один объект меньше другого, делается произвольно – но одинаково в течение всего исполнения программы.

source: Comparison of objects of the differing types depends on whether either of the types provide explicit support for the comparison. Most numeric types can be compared with one another, but comparisons of :class:`float` and :class:`Decimal` are not supported to avoid the inevitable confusion arising from representation issues such as ``float('1.1')`` being inexactly represented and therefore not exactly equal to ``Decimal('1.1')`` which is. When cross-type comparison is not supported, the comparison method returns ``NotImplemented``. This can create the illusion of non-transitivity between supported cross-type comparisons and unsupported comparisons. For example, ``Decimal(2) == 2`` and `2 == float(2)`` but ``Decimal(2) != float(2)``.
ru: Сравнение объектов различающихся типов зависит от того, предоставляет ли тип кого-либо из них явную поддержку для такого сравнения. Большинство числовых типов можно сравнивать друг с другом, но сравнение «:class:`float`» с «:class:`Decimal`» не поддерживается – для избежания неустранимой неясности, происходящей из особенностей представления (реализации) , например «``float('1.1')``» , чьё машинное представление является приближённым и, как следствие, является не строго равным «``Decimal('1.1')``» , чьё машинное представление строго соответствует записи. Когда межтиповое сравнение не поддерживается – возвращается «``NotImplemented``» . Это может создать иллюзию нетранзитивности между поддерживаемыми и неподдерживаемыми межтиповыми сравнениями. Например, «``Decimal(2) == 2``» и «``2 == float(2)``» , но «``Decimal(2) != float(2)``» .

source: The operators :keyword:`in` and :keyword:`not in` test for membership. ``x in s`` evaluates to true if *x* is a member of *s*, and false otherwise. ``x not in s`` returns the negation of ``x in s``. All built-in sequences and set types support this as well as dictionary, for which :keyword:`in` tests whether a the dictionary has a given key. For container types such as list, tuple, set, frozenset, dict, or collections.deque, the expression ``x in y`` is equivalent to ``any(x is e or x == e for e in y)``.
ru: Операторы «:keyword:`in`» и «:keyword:`not in`» проверяют на вхождение (членство) . «``x in s``» даёт результат «:const:`True`» если «``x``» является членом «``s``» – в остальных случаях – результат «:const:`False`» . Все встроенные последовательности и множества поддерживают эти инструкции, при этом для словаря подразумевается поиск во множестве его ключей. Для контейнерных типов – таких как список, кортеж, множество, фиксированное множество, словарь или «``collections.deque``» – выражение «``x in y``» является эквивалентом «``any(x is e or x == e for e in y)``» .

source: For the string and bytes types, ``x in y`` is true if and only if *x* is a substring of *y*. An equivalent test is ``y.find(x) != -1``. Empty strings are always considered to be a substring of any other string, so ``"" in "abc"`` will return ``True``.
ru: Для текстовых и байтовых типов «``x in y``» даёт результат «:const:`True`» только если «``x``» является подстрокой для «``y``» . Эквивалентом является «``y.find(x) != -1``» . Пустой текст считается подстрокой для любого текста, тоесть : «``"" in "abc"``» вернёт «:const:`True`» .

source: For user-defined classes which define the :meth:`__contains__` method, ``x in y`` is true if and only if ``y.__contains__(x)`` is true.
ru: Для пользовательских классов, в которых определён метод «:meth:`__contains__`» , результат операции «in» определяется исключительно этим методом.

source: For user-defined classes which do not define :meth:`__contains__` but do define :meth:`__iter__`, ``x in y`` is true if some value ``z`` with ``x == z`` is produced while iterating over ``y``. If an exception is raised during the iteration, it is as if :keyword:`in` raised that exception.
ru: Для пользовательских классов, в которых не определён метод «:meth:`__contains__`» , но определён метод «:meth:`__iter__`» , операция «``x in y``» даёт результат «:const:`True`» , если при переборе элементов «``y``» находится хотя бы одно такое значение «``z``» , что «``x == z``» . Если при этом переборе происходит исключение, то эффект таков, как если бы оно произошло в самой операции «:keyword:`in`» .

source: Lastly, the old-style iteration protocol is tried: if a class defines :meth:`__getitem__`, ``x in y`` is true if and only if there is a non-negative integer index *i* such that ``x == y[i]``, and all lower integer indices do not raise :exc:`IndexError` exception. (If any other exception is raised, it is as if :keyword:`in` raised that exception).
ru: И, наконец, делается попытка использовать протокол перебора в старом стиле : если в классе определён «:meth:`__getitem__`» , то «``x in y``» даёт в результате «:const:`True`» только если есть такое неотрицательный целый индекс «``i``» , что «``x == y[i]``» и все меньшие индексы не вызывают исключение «:exc:`IndexError`» . Если происходит исключение любого другого типа, то эффект таков, как если бы оно произошло в самой операции «:keyword:`in`» .

source: The operator :keyword:`not in` is defined to have the inverse true value of :keyword:`in`.
ru: Оператор «:keyword:`not in`» определён как отрицание логического результата «:keyword:`in`» (над теми же операндами) .

source: The operators :keyword:`is` and :keyword:`is not` test for object identity: ``x is y`` is true if and only if *x* and *y* are the same object. ``x is not y`` yields the inverse truth value. [#]_
ru: Операторы «:keyword:`is`» и «:keyword:`is not`» проверяют на идентичность объекта : «``x is y``» даёт в результате «:const:`True`» только если «``x``» и «``y``» являются одним и тем же объектом. «``is not y``» даёт отрицание логического результата оператора «``is``» (над теми же операндами) .

source: Boolean operations
ru: Логические операции

source: In the context of Boolean operations, and also when expressions are used by control flow statements, the following values are interpreted as false: ``False``, ``None``, numeric zero of all types, and empty strings and containers (including strings, tuples, lists, dictionaries, sets and frozensets). All other values are interpreted as true. User-defined objects can customize their truth value by providing a :meth:`__bool__` method.
ru: В контексте логических операций а также в выражениях-параметрах инструкций управления потоком программы (ветвления, циклы) – следующие значения интерпретируются как логическая ложь : «:const:`False`» , «:const:`None`» , число ноль любого типа, пустые строки, пустые контейнеры. Все остальные значения интерпретируются как логическая истина. Определённые пользователем объекты могут задать значение истинности определив метод «:meth:`__bool__`» .

source: The operator :keyword:`not` yields ``True`` if its argument is false, ``False`` otherwise.
ru: Оператор «:keyword:`not`» даёт в результате «:const:`True`» , если его аргумент является ложью, иначе – даёт в результате «:const:`False`» .

source: The expression ``x and y`` first evaluates *x*; if *x* is false, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
ru: Для выражения «``x and y``» сначала вычисляется значение выражения «``x``» – если это значение ложно, то возвращается это значение (которое было до приведения к логическому типу) , иначе дальше вычисляется значение выражения «``y``» и оно возвращается (без приведения к логическому типу) в качестве значения операции «``and``» .

source: The expression ``x or y`` first evaluates *x*; if *x* is true, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
ru: Для выражения «``x or y``» сначала вычисляется значение выражения «``x``» – если это значение истинно, то возвращается это значение (которое было до приведения к логическому типу) , иначе дальше вычисляется значение выражения «``y``» и оно возвращается (без приведения к логическому типу) в качестве значения операции «``or``» .

source: (Note that neither :keyword:`and` nor :keyword:`or` restrict the value and type they return to ``False`` and ``True``, but rather return the last evaluated argument. This is sometimes useful, e.g., if ``s`` is a string that should be replaced by a default value if it is empty, the expression ``s or 'foo'`` yields the desired value. Because :keyword:`not` has to invent a value anyway, it does not bother to return a value of the same type as its argument, so e.g., ``not 'foo'`` yields ``False``, not ``''``.)
ru: Заметьте, что ни «:keyword:`and`» , ни «:keyword:`or`» не ограничивают значение и тип результата значениями «:const:`False`» и «:const:`True`» , а просто возвращают в неизменном виде значение операнда, взятого последним. Это иногда может быть полезно – например, если «``s``» – текст, который, если он пустой, должен быть заменён на текст по-умолчанию, то выражение «``s or 'foo'``» даёт какраз такой эффект. Поскольку операция «:keyword:`not`» в любом случае должна сгенерировать новое значение, то она не заботится о том, чтобы вернуть значение того же типа, что и её аргумент, поэтому, например, «``not 'foo'``» выдаёт «:const:`False`» , а не «``''``» .

source: Lambdas
ru: Ламбда-функции

source: Lambda forms (lambda expressions) have the same syntactic position as expressions. They are a shorthand to create anonymous functions; the expression ``lambda arguments: expression`` yields a function object. The unnamed object behaves like a function object defined with ::
ru: Ламбда-выражения находятся в той же позиции, в которой ожидается обычное выражение. Они являются сокращённой формой создания анонимных функций. Выражение «``lambda arguments: expression``» возвращает вместо себя объект-функцию. Этот безымянный объект-функция ведёт себя, как если бы был определён так : ::

source: See section :ref:`function` for the syntax of parameter lists. Note that functions created with lambda forms cannot contain statements or annotations.
ru: Смотрите синтаксис списка параметров в разделе «Определение функций» :ref:`function` . Заметьте, что функции, созданные ламбда-выражением, не могут содержать инструкций или аннотаций.

source: Expression lists
ru: Списки выражений

source: An expression list containing at least one comma yields a tuple. The length of the tuple is the number of expressions in the list. The expressions are evaluated from left to right.
ru: Список выражений, содержащий как минимум одну запятую, даёт в результате кортеж. Длинною кортежа считается количество его элементов (выражений в соответствующем списке) . Эти выражения вычисляются поочерёдно с лева направо.

source: The trailing comma is required only to create a single tuple (a.k.a. a *singleton*); it is optional in all other cases. A single expression without a trailing comma doesn't create a tuple, but rather yields the value of that expression. (To create an empty tuple, use an empty pair of parentheses: ``()``.)
ru: Запятая в самом конце, после последнего элемента – требуется только для создания одноэлементного кортежа (“singleton” , “одиночка”) – в других случаях такая концевая запятая не требуется. Одиночное выражение без такой концевой запятой после него не создаёт кортеж, а просто возвращает само значение этого выражения. А для обозначения пустого кортежа используйте пустую пару круглых скобок : «`` ( ) ``» .

source: Evaluation order
ru: Очерёдность вычисления

source: Python evaluates expressions from left to right. Notice that while evaluating an assignment, the right-hand side is evaluated before the left-hand side.
ru: Питон обрабатывает (вычисляет) выражения с лева направо. Заметьте, что при обработке назначений – сначала обрабатывается правая часть (источник) , потом левая (получатель) .

source: In the following lines, expressions will be evaluated in the arithmetic order of their suffixes::
ru: В следующем коде числа на концах имён выражений соответствуют очерёдности их обработки : ::

source: Summary
ru: Обобщение

source: The following table summarizes the operator precedences in Python, from lowest precedence (least binding) to highest precedence (most binding). Operators in the same box have the same precedence. Unless the syntax is explicitly given, operators are binary. Operators in the same box group left to right (except for comparisons, including tests, which all have the same precedence and chain from left to right --- see section :ref:`comparisons` --- and exponentiation, which groups from right to left).
ru: Следующая таблица показывает приоритетность операторов в Питоне – от наименьшей приоритетности (слабейшая связь с операндами) к наивысшей (сильнейшая связь) . Операторы в одной ячейке имеют одинаковую приоритетность. Если синтаксис не указан явно – подразумеваются двухоперандные операторы. Операторы из одной ячейки приоритетности, идущие в коде подряд, исполняются с лева направо (кроме операторов сравнения и возведения в степень, у которых обратный порядок исполнения – смотрите :ref:`comparisons` ) .

source: Operator
ru: Оператор

source: Description
ru: Описание

source: Lambda expression
ru: Ламбда-выражение

source: Conditional expression
ru: Выражение условия

source: Boolean OR
ru: Логическое ИЛИ

source: Boolean AND
ru: Логическое И

source: Boolean NOT
ru: Логическое НЕ

source: Comparisons, including membership tests and identity tests,
ru: Сравнения, проверки на идентичность или вхождение

source: Bitwise OR
ru: Побитовое ИЛИ

source: Bitwise XOR
ru: Побитовое Исключающее ИЛИ (XOR)

source: Bitwise AND
ru: Побитовое И

source: Shifts
ru: Сдвиги

source: Addition and subtraction
ru: Сложение и вычитание

source: Multiplication, division, remainder
ru: Умножение, деление, остаток

source: Positive, negative, bitwise NOT
ru: Позитивация, негативация, побитовое НЕ

source: Exponentiation [#]_
ru: Степень [#]_

source: Subscription, slicing, call, attribute reference
ru: Индексация, вызов, обращение к атрибуту

source: Binding or tuple display, list display, dictionary display,
ru: Записи (:term:`display`) : кортежа или списка получателей, списка, словаря, множества

source: The power operator ``**`` binds less tightly than an arithmetic or bitwise unary operator on its right, that is, ``2**-1`` is ``0.5``.
ru: Оператор степени «``**``» имеет меньший приоритет, чем арифметические или побитовые однооперандные операторы непосредственно справа от него, так, например, «``2**-1``» даёт «``0.5``» .

source: Full Grammar specification
ru: Полная спецификация грамматики

source: Date
ru: Дата

source: Lexical analysis
ru: Лексический анализ

source: Line structure
ru: Структура строк

source: A Python program is divided into a number of *logical lines*.
ru: Программа на Питоне состоит из *условных (логических) строк*.

source: Logical lines
ru: Условные строки

source: The end of a logical line is represented by the token NEWLINE. Statements cannot cross logical line boundaries except where NEWLINE is allowed by the syntax (e.g., between statements in compound statements). A logical line is constructed from one or more *physical lines* by following the explicit or implicit *line joining* rules.
ru: Условные строки состоят из одной или нескольких *физических строк*, объединённых по правилам явного или неявного *объединения строк*. Инструкции не могут пересекать границы условных строк, за исключением специальных случаев, предусмотренных синтаксисом (например, составные инструкции).

source: Physical lines
ru: Физические строки

source: When embedding Python, source code strings should be passed to Python APIs using the standard C conventions for newline characters (the ``\n`` character, representing ASCII LF, is the line terminator).
ru: При встраивании Питона в другое приложение, строки исходного кода на Питоне следует передавать из этого приложения в API Питона, следуя стандартным соглашениям языка “C” для символов новой строки (тоесть, символ «`` ``» , обозначающий ASCII LF ) .

source: Comments
ru: Комментарии

source: A comment starts with a hash character (``#``) that is not part of a string literal, and ends at the end of the physical line. A comment signifies the end of the logical line unless the implicit line joining rules are invoked. Comments are ignored by the syntax; they are not tokens.
ru: Комментарий начинается с символа «``#``» (“решётка”), если тот не является частью записи текстовых данных, и продолжается до конца физической строки. Комментарий также обозначает конец условной строки, кроме тех случаев, когда происходит неявное объединение условных строк. Комментарии игнорируются при анализе текста программы и не являются лексемами (токенами).

source: Explicit line joining
ru: Явное объединение строк

source: Two or more physical lines may be joined into logical lines using backslash characters (``\``), as follows: when a physical line ends in a backslash that is not part of a string literal or comment, it is joined with the following forming a single logical line, deleting the backslash and the following end-of-line character. For example::
ru: Две или более физических строк могут быть объединены в одну условную строку при помощи символа бэкслэш (``\``) следующим образом: когда строка заканчивается бэкслэшем, не являющимся частью текстовых данных или комментария, она объединяется со следующей, составляя единую условную строку, не включающую бэкслэш и следующий за ним символ окончания строки. Например:

source: A line ending in a backslash cannot carry a comment. A backslash does not continue a comment. A backslash does not continue a token except for string literals (i.e., tokens other than string literals cannot be split across physical lines using a backslash). A backslash is illegal elsewhere on a line outside a string literal.
ru: Строка, оканчивающаяся бэкслэшем, не может содержать комментарий. Комментарий или другую лексему кроме текстовых данных, начатые на одной строке, нельзя продолжить с помощью бэкслэша на другой строке. Кроме конца физической строки бэкслэш допустим только внутри текстовых данных.

source: Implicit line joining
ru: Неявное объединение строк

source: Expressions in parentheses, square brackets or curly braces can be split over more than one physical line without using backslashes. For example::
ru: Выражения в скобках - круглых, квадратных либо фигурных - могут быть разделены на несколько физических строк без использования бэкслэша. Например:

source: Blank lines
ru: Пустые строки

source: A logical line that contains only spaces, tabs, formfeeds and possibly a comment, is ignored (i.e., no NEWLINE token is generated). During interactive input of statements, handling of a blank line may differ depending on the implementation of the read-eval-print loop. In the standard interactive interpreter, an entirely blank logical line (i.e. one containing not even whitespace or a comment) terminates a multi-line statement.
ru: Условные строки, содержащие только пробелы, знаки табуляции или перевода страницы и комментарии игнорируется (т.е. не создается лексемы “NEWLINE”). Во время интерактивного ввода операторов обработка пустой последовательности может отличаться в зависимости от реализации цикла чтение-вычисление-вывод. В стандартном интерактивном интерпретаторе полностью пустая условная строка (т.е. не содержащая даже пробел или комментарий) завершает многострочный оператор.

source: Indentation
ru: «:term:`Отступы`»

source: Indentation is rejected as inconsistent if a source file mixes tabs and spaces in a way that makes the meaning dependent on the worth of a tab in spaces; a :exc:`TabError` is raised in that case.
ru: Отступы не принимаются из-за противоречивости, если исходный файл смешивает табуляции и пробелы таким образом, что делает смысл зависящим от размера табуляции в пробелах; в таком случае генерируется «:exc:`TabError`» .

source: **Cross-platform compatibility note:** because of the nature of text editors on non-UNIX platforms, it is unwise to use a mixture of spaces and tabs for the indentation in a single source file. It should also be noted that different platforms may explicitly limit the maximum indentation level.
ru: **Замечание о кроссплатформенной совместимости:** из-за особенностей текстовых редакторов на не-UNIX платформах - не следует использовать смесь пробелов и табуляций для отступов в одном исодном файле. Также следует отметить, что различные платформы могут явно ограничивать максимальный уровень отступов.
